Config/Catalogs/ОбъектыФинансовыхВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыФинансовыхВложений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУчастияВКапитале</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыУчастияВКапитале</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансовыхВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНФИ</Name>
					<Comment>Реестровый номер федерального имущества</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеннойБумаги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документарные</Name>
					<Comment>Ложь - бездокументарные акции, Истина - документарные акции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦеннойБумаги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ДолиУчастияВКапитале.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДолиУчастияВКапитале</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоляВПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВыпискиИзРеестраАкционеров</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминальныйДержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФинансовогоВложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыФинансовыхВложений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ПакетыАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПакетыАкций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФинансовогоВложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыФинансовыхВложений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВыпускАкций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВыпускиАкций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыФинансовыхВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыФинансовыхВложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастиеВКапитале</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеФинансовыеАктивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ФормыУчастияВКапитале.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФормыУчастияВКапитале</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вклады</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеФормыУчастияВКапитале</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ОбъектыФинансовыхВложений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ОбъектФинансовыхВложенийСсылка = Справочники.ОбъектыФинансовыхВложений.ПолучитьСсылку();
		
		ВедущиеОбъекты = Новый Структура("Организация, ОбъектФинансовогоВложения", Объект.Организация, ОбъектФинансовыхВложенийСсылка);
		
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ДолиУчастияВКапитале", ВедущиеОбъекты);
		
		Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
			Объект.Валюта = ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьВидимостьЭлементов(ЭтотОбъект);
	
	УстановитьВидимостьПредупреждения();
	
	Элементы.ПакетыАкций.Заголовок = СформироватьЗаголовокСпискаПакетовАкций(Объект.Организация, ОбъектФинансовыхВложенийСсылка);
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьАвтоНаименование();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСоставаПакетовАкций" И (Параметр = ОбъектФинансовыхВложенийСсылка
		Или Параметр = ПредопределенноеЗначение("Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка")) Тогда
	
		Элементы.ПакетыАкций.Заголовок = СформироватьЗаголовокСпискаПакетовАкций(Объект.Организация, ОбъектФинансовыхВложенийСсылка);
		
	Конецесли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбъектФинансовыхВложенийСсылка =  ТекущийОбъект.Ссылка;
	
	ВедущиеОбъекты = Новый Структура("Организация, ОбъектФинансовогоВложения", Объект.Организация, ОбъектФинансовыхВложенийСсылка);
	
	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ДолиУчастияВКапитале", ВедущиеОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ДолиУчастияВКапитале");
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());

КонецПроцедуры
 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(ОбъектФинансовыхВложенийСсылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьСведенияОДоле();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Если НЕ ПараметрыЗаписи.ЭтоНовый Тогда
		
		ВедущиеОбъекты = Новый Структура("Организация, ОбъектФинансовогоВложения", Объект.Организация, ОбъектФинансовыхВложенийСсылка);
		
		ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ДолиУчастияВКапитале", ВедущиеОбъекты);
		
	КонецЕсли; 
	
	УстановитьВидимостьПредупреждения();
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ВедущиеОбъекты = Новый Структура("Организация, ОбъектФинансовогоВложения", Объект.Организация, ОбъектФинансовыхВложенийСсылка);
	
		ОбщегоНазначенияБГУ.ПроверитьЗаписьВФорме(ЭтотОбъект, "ДолиУчастияВКапитале", ВедущиеОбъекты, Отказ);
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОбновитьАвтоНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВложенияПриИзменении(Элемент)
	
	УстановитьДоступностьВидимостьЭлементов(ЭтотОбъект);
	
	ОбновитьАвтоНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаУчастияВКапиталеПриИзменении(Элемент)
	
	УстановитьДоступностьВидимостьЭлементов(ЭтотОбъект);
	
	ОбновитьАвтоНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеннойБумагиПриИзменении(Элемент)
	
	ОбновитьАвтоНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//Запрет редактирования реквизитов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)

	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры
//Конец Запрет редактирования реквизитов  

// ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ИмяФормы);
	
КонецПроцедуры

//Конец ИНФОРМАЦИОННЫЙ ЦЕНТР
                                                                                  
&НаКлиенте                                                                                               
Процедура ПоказатьИсториюДолей(Команда)
	
	Отбор = Новый Структура(" Организация, ОбъектФинансовогоВложения", Объект.Организация, ОбъектФинансовыхВложенийСсылка);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, ТолькоПросмотр", Отбор, Истина, Истина);
	ОткрытьФорму("РегистрСведений.ДолиУчастияВКапитале.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПакетыАкций(Команда)
	                                                                                 
	Отбор = Новый Структура("Организация, ОбъектФинансовогоВложения", Объект.Организация, ОбъектФинансовыхВложенийСсылка);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, ТолькоПросмотр", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.ПакетыАкций.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьСведенияОДоле()
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДолиУчастияВКапитале) Тогда
		Возврат;
	КонецЕсли;
	
	ВедущиеОбъекты = Новый Структура("Организация, ОбъектФинансовогоВложения", Объект.Организация, ОбъектФинансовыхВложенийСсылка);
	
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ДолиУчастияВКапитале", ВедущиеОбъекты);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоЦенныеБумаги = Объект.ВидВложения = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхВложений.ЦенныеБумаги");
	ЭтоУчастиеВКапитале = Объект.ВидВложения = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхВложений.УчастиеВКапитале");
	ЭтоАкции = ЭтоУчастиеВКапитале И Объект.ФормаУчастияВКапитале = ПредопределенноеЗначение("Перечисление.ФормыУчастияВКапитале.Акции");
	
	Элементы.ГруппаВложенияВКапитал.Видимость = ЭтоУчастиеВКапитале;
	Элементы.ФормаУчастияВКапитале.Видимость = ЭтоУчастиеВКапитале;
	Элементы.ГруппаРеквизитыАкций.Видимость = ЭтоАкции;
	Элементы.ВидЦеннойБумаги.Видимость = ЭтоЦенныеБумаги;
	Элементы.ФормаЦеннойБумаги.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	Элементы.НоминальнаяСтоимость.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	Элементы.ВалютаНоминала.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	Элементы.Серия.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	Элементы.Номер.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	Элементы.РегистрационныйНомер.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	Элементы.ЕдиницаИзмерения.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	Элементы.КодЦеннойБумаги.Видимость = ЭтоЦенныеБумаги ИЛИ ЭтоАкции;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредупреждения()
	
	МассивЭлементов = Новый Массив;
	
	МассивЭлементов.Добавить("ИсторияДолей");
	МассивЭлементов.Добавить("ПакетыАкций");

	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", НЕ Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьАвтоНаименование()
	
	Если Объект.ВидВложения = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхВложений.УчастиеВКапитале") Тогда
		АвтоНаименование = СокрЛП(Объект.ФормаУчастияВКапитале) + " ";
	ИначеЕсли Объект.ВидВложения = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхВложений.ЦенныеБумаги") Тогда
		АвтоНаименование = СокрЛП(Объект.ВидЦеннойБумаги) + " ";
	Иначе
		АвтоНаименование = СокрЛП(Объект.ВидВложения) + " ";
	КонецЕсли;
	
	АвтоНаименование = АвтоНаименование + СокрЛП(Объект.Контрагент);
	
	Возврат АвтоНаименование;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьАвтоНаименование()
	
	АвтоНаименование = ПолучитьАвтоНаименование();
	
	Элементы.Наименование.СписокВыбора.Очистить();
	Элементы.Наименование.СписокВыбора.Добавить(АвтоНаименование);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьЗаголовокСпискаПакетовАкций(СсылкаОрганизации, СсылкаОбъектаВложений)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПакетыАкцийСрезПоследних.ВыпускАкций.Представление КАК Выпуск
	                      |ИЗ
	                      |	РегистрСведений.ПакетыАкций.СрезПоследних(
	                      |			,
	                      |			Организация = &Организация
	                      |				И ОбъектФинансовогоВложения = &ОбъектФинансовогоВложения
	                      |				И Количество > 0) КАК ПакетыАкцийСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация", СсылкаОрганизации);
    Запрос.УстановитьПараметр("ОбъектФинансовогоВложения", СсылкаОбъектаВложений);
 	  		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		
		Возврат "Информация о пакетах акций отсутствует. Нажмите, чтобы добавить";
		
	КонецЕсли;
	
	МассивРезультатов = Результат.Выгрузить().ВыгрузитьКолонку("Выпуск");
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru =  'Пакеты акций (всего %1): %2'"), МассивРезультатов.Количество(), 
	СтрСоединить(МассивРезультатов, "," ));
	
КонецФункции	

#КонецОбласти
